Tekla Open API Reference for Tekla Structures 2025
CannotSetAttributeForPluginDueToIncorrectTypeException Class
 The CannotSetAttributeForPluginDueToIncorrectTypeException class defines the exception that is thrown when Plugin.SetAttribute is called but the type is incorrect.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToIncorrectTypeException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotSetAttributeForPluginDueToIncorrectTypeException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotSetAttributeForPluginDueToIncorrectTypeException
	Inherits TeklaStructuresDrawingsApplicationException
The CannotSetAttributeForPluginDueToIncorrectTypeException type exposes the following members.
Constructors
Name | Description
CannotSetAttributeForPluginDueToIncorrectTypeException
 Creates a new CannotSetAttributeForPluginDueToIncorrectTypeException instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace